app/User.php

    public function hasAnyRoles($roles){

        if($this->roles()->whereIn('name', $roles)->first()){
---
select `roles`.*, `role_user`.`user_id` as `pivot_user_id`, `role_user`.`role_id` as `pivot_role_id` from `roles` inner join `role_user` on `roles`.`id` = `role_user`.`role_id` where `role_user`.`user_id` = 1 and `name` in ('admin', 'moderator') limit 1

    public function hasRole($role){

        if($this->roles()->where('name', $role)->first()){
---
select `roles`.*, `role_user`.`user_id` as `pivot_user_id`, `role_user`.`role_id` as `pivot_role_id` from `roles` inner join `role_user` on `roles`.`id` = `role_user`.`role_id` where `role_user`.`user_id` = 1 and `name` = 'admin' limit 1