app/Http/Controllers/EventsController.php

insert into `events` (`name`, `date`, `start_at`, `end_at`, `lat`, `lng`, `updated_at`, `created_at`) values ('fewfwe', '2020-08-29', '00:02:00', '03:02:00', 0, 0, '2020-08-29 19:52:50', '2020-08-29 19:52:50')
---
    public function create(Request $request,Event $event)
    {

        $event->name = $request->name;
        $event->date = $request->date;
        $event->start_at = $request->start_at;
        $event->end_at = $request->end_at;
        $event->lat = $request->lat;
        $event->lng = $request->lng;

        $event->save();