app/Http/Controllers/Admin/UsersController.php

    public function index()
    {
        $users = User::all();
---
select * from `users`